IdeaRS.OpenModel.Message.IDEAProgress
Progress Report for IOM

IdeaRS.OpenModel.Message.IDEAProgress.callback
Callback function of progress

IdeaRS.OpenModel.Message.IDEAProgress.#ctor(System.Action{IdeaRS.OpenModel.Message.IDEAProgressReport})
Constructor
callback: Callback function of progress

IdeaRS.OpenModel.Message.IDEAProgress.Report(IdeaRS.OpenModel.Message.IDEAProgressReport)
Report
data: Data for progress report of IOM